Revit 2027 API
ParameterTypeId.FabricationPartWidthOutOption Property
 "Main Secondary Width Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartWidthOutOption { get; }
Public Shared ReadOnly Property FabricationPartWidthOutOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartWidthOutOption {
	ForgeTypeId^ get ();
}
static member FabricationPartWidthOutOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace